tests/DataFixtures/invoice.json

{
    "facade":"pos/invoice",
    "data":
        {
            "url":"https://test.bitpay.com/invoice?id=abcdefghijkmnopqrstuvw",
            "paymentUrls":
                {
                    "BIP21":"bitcoin:mabcdefghijkmnopqrstuvw123456789AB?amount=0.0632",
                    "BIP72":"bitcoin:mabcdefghijkmnopqrstuvw123456789AB?amount=0.0632&r=https://test.bitpay.com/i/abcdefghijkmnopqrstuvw",
                    "BIP72b":"bitcoin:?r=https://test.bitpay.com/i/E8XNwAbkMQJpADZNd8rkA5","BIP73":"https://test.bitpay.com/i/abcdefghijkmnopqrstuvw"
                },
            "posData":"",
            "status":"new",
            "btcPrice":"0.0632",
            "btcDue":"0.0632",
            "price":19.95,
            "currency":"USD",
            "exRates":
                {
                    "USD":315.70000000000005
                },
            "itemDesc":"",
            "orderId":"TEST-01",
            "invoiceTime":1412594514486,
            "expirationTime":1412595414486,
            "currentTime":1412594514518,
            "guid":"c2da30dd-1a34-b5f4-2845-e7cef414e2a0",
            "id":"abcdefghijkmnopqrstuvw",
            "transactions":[],
            "btcPaid":"0.0000",
            "rate":315.7,
            "exceptionStatus":false,
            "buyerFields":
                {
                    "buyerName":"",
                    "buyerAddress1":"",
                    "buyerAddress2":"",
                    "buyerCity":null,
                    "buyerState":null,
                    "buyerZip":null,
                    "buyerCountry":null,
                    "buyerEmail":null,
                    "buyerPhone":null
                },
            "token":"abcdefghijklmno"
        }
}
