tests/DataFixtures/payouts/7m7hSF3ws1LhnWUf17CXsJ.json

{
  "facade":"payroll/payoutRequest",
  "data":
  {
    "id":"7m7hSF3ws1LhnWUf17CXsJ",
    "account":"Lwbnf9XAPCxDmy8wsRH3ct",
    "status":"new",
    "amount":5625,
    "btc":null,
    "currency":"USD",
    "reference": "your reference, can be json",
    "requestDate":"2014-11-13T04:30:07.905Z",
    "effectiveDate":"2014-11-15T05:00:00.000Z",
    "pricingMethod":"bitcoinbestbuy",
    "notificationURL": "https://bitpay.com",
    "notificationEmail": "support@bitpay.com",
    "instructions":[
      {
        "id":"Sra19AFU57Rx53rKQbbRKZ",
        "amount":1875,
        "btc":{
          "unpaid":null,
          "paid":0
        },
        "address":"mzzsJ8G9KBmHPPVYaMxpYRetWRRec78FvF",
        "label":"2",
        "transactions":[],
        "status":"unpaid"
      },{
        "id":"5SCdU1xNsEwrUFqKChYuAR",
        "amount":1875,
        "btc":{
          "unpaid":null,
          "paid":0
        },
        "address":"mre3amN8KCFuy7gWCjhFXjuqkmoJMkd2gx",
        "label":"3",
        "transactions":[],
        "status":"unpaid"
      },{
        "id":"5cHNbnmNuo8gRawnrFZsPy",
        "amount":1875,
        "btc":{
          "unpaid":null,
          "paid":0
        },
        "address":"mre3amN8KCFuy7gWCjhFXjuqkmoJMkd2gx",
        "label":"4",
        "transactions":[],
        "status":"unpaid"
      }],
    "token":"8mZ37Gt91Wr7GXGPnB9zj1zwTcLGweRDka4axVBPi9Uxiiv7zZWvEKSgmFddQZA1Jy"
  }
}